<!-- add-pr-comment:add-pr-comment -->

Terraform Plan **Production**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_instance.myec2vm[0] will be created
+   resource "aws_instance" "myec2vm" {
+       ami                                  = "ami-0c9e929defa073d7d"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "terraform-key"
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Environment" = "GithubActionsWorkflow"
+           "Name"        = "CI/CD_jeRemyC_0"
+           "Service"     = "CICD"
        }
+       tags_all                             = {
+           "Environment" = "GithubActionsWorkflow"
+           "Name"        = "CI/CD_jeRemyC_0"
+           "Service"     = "CICD"
        }
+       tenancy                              = (known after apply)
+       user_data                            = "115d9a6ff7166c0c84f76b87379953bfd452c8e9"
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)
    }

  # aws_security_group.vpc-ssh will be created
+   resource "aws_security_group" "vpc-ssh" {
+       arn                    = (known after apply)
+       description            = "Dev VPC SSH"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow all ports outbound"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow Port 22"
+               from_port        = 22
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 22
            },
        ]
+       name                   = "vpc-ssh-terragrunt-infracost"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "vpc-ssh-terragrunt-infracost"
        }
+       tags_all               = {
+           "Name" = "vpc-ssh-terragrunt-infracost"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.vpc-web will be created
+   resource "aws_security_group" "vpc-web" {
+       arn                    = (known after apply)
+       description            = "Dev VPC SSH"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow all ports outbound"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow Port 443"
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow Port 80"
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
        ]
+       name                   = "vpc-web-terragrunt-infracost"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "vpc-web-terragrunt-infracost"
        }
+       tags_all               = {
+           "Name" = "vpc-web-terragrunt-infracost"
        }
+       vpc_id                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   for_output_list                 = [
+       (known after apply),
    ]
+   for_output_map1                 = (known after apply)
+   for_output_map2                 = {
+       "0" = (known after apply)
    }
+   latest_splat_instance_publicdns = [
+       (known after apply),
    ]
+   legacy_splat_instance_publicdns = [
+       (known after apply),
    ]
```

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.myec2vm[0] will be created
  + resource "aws_instance" "myec2vm" {
      + ami                                  = "ami-0c9e929defa073d7d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "GithubActionsWorkflow"
          + "Name"        = "CI/CD_jeRemyC_0"
          + "Service"     = "CICD"
        }
      + tags_all                             = {
          + "Environment" = "GithubActionsWorkflow"
          + "Name"        = "CI/CD_jeRemyC_0"
          + "Service"     = "CICD"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "115d9a6ff7166c0c84f76b87379953bfd452c8e9"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_security_group.vpc-ssh will be created
  + resource "aws_security_group" "vpc-ssh" {
      + arn                    = (known after apply)
      + description            = "Dev VPC SSH"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all ports outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow Port 22"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "vpc-ssh-terragrunt-infracost"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "vpc-ssh-terragrunt-infracost"
        }
      + tags_all               = {
          + "Name" = "vpc-ssh-terragrunt-infracost"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.vpc-web will be created
  + resource "aws_security_group" "vpc-web" {
      + arn                    = (known after apply)
      + description            = "Dev VPC SSH"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all ports outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow Port 443"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow Port 80"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "vpc-web-terragrunt-infracost"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "vpc-web-terragrunt-infracost"
        }
      + tags_all               = {
          + "Name" = "vpc-web-terragrunt-infracost"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + for_output_list                 = [
      + (known after apply),
    ]
  + for_output_map1                 = (known after apply)
  + for_output_map2                 = {
      + "0" = (known after apply)
    }
  + latest_splat_instance_publicdns = [
      + (known after apply),
    ]
  + legacy_splat_instance_publicdns = [
      + (known after apply),
    ]

```